FRASTM/zephyr/drivers/flash/flash_stm32_mspi.c
#define DT_WRITEOC_PROP_OR(inst, default_value)							\
	COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, writeoc),					\
		    (_CONCAT(SPI_NOR_CMD_, DT_STRING_TOKEN(DT_DRV_INST(inst), writeoc))),	\
		    ((default_value)))

#define DT_QER_PROP_OR(inst, default_value)							\
	COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, quad_enable_requirements),			\
		    (_CONCAT(JESD216_DW15_QER_VAL_,						\
			     DT_STRING_TOKEN(DT_DRV_INST(inst), quad_enable_requirements))),	\
		    ((default_value)))

static void flash_stm32_mspi_irq_config_func(const struct device *dev);

static const struct stm32_pclken pclken[] = STM32_DT_CLOCKS(STM32_MSPI_NODE);

PINCTRL_DT_DEFINE(STM32_MSPI_NODE);

static const struct flash_stm32_mspi_config flash_stm32_mspi_cfg = {
	.pclken = pclken,
	.pclk_len = DT_NUM_CLOCKS(STM32_MSPI_NODE),
	.irq_config = flash_stm32_mspi_irq_config_func,
	.flash_size = DT_INST_PROP(0, size),
	.mspicfg = MSPI_CONFIG(0),
	.pcfg = PINCTRL_DT_DEV_CONFIG_GET(STM32_MSPI_NODE),
#if STM32_MSPI_RESET_GPIO
	.reset = GPIO_DT_SPEC_INST_GET(0, reset_gpios),
#endif /* STM32_MSPI_RESET_GPIO */
};

static struct flash_stm32_mspi_data flash_stm32_mspi_dev_data = {
	.hmspi = {
		.Instance = (XSPI_TypeDef *)DT_REG_ADDR(STM32_MSPI_NODE),
		.Init = {
			.FifoThresholdByte = STM32_MSPI_FIFO_THRESHOLD,
			.SampleShifting = (DT_PROP(STM32_MSPI_NODE, ssht_enable)
					? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE
					: HAL_XSPI_SAMPLE_SHIFT_NONE),
			.ChipSelectHighTimeCycle = 1,
			.ClockMode = HAL_XSPI_CLOCK_MODE_0,
			.ChipSelectBoundary = 0,
			.MemoryMode = HAL_XSPI_SINGLE_MEM,
#if defined(HAL_XSPIM_IOPORT_1) || defined(HAL_XSPIM_IOPORT_2)
			.MemorySelect = ((DT_INST_PROP(0, ncs_line) == 1)
					? HAL_XSPI_CSSEL_NCS1
					: HAL_XSPI_CSSEL_NCS2),
#endif
			.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE,
#if defined(OCTOSPI_DCR4_REFRESH)
			.Refresh = 0,
#endif /* OCTOSPI_DCR4_REFRESH */
		},
	},
	.qer_type = DT_QER_PROP_OR(0, JESD216_DW15_QER_VAL_S1B6),
	.page_size = SPI_NOR_PAGE_SIZE, /* by default, to be updated by sfdp */
	.cfg = MSPI_DEVICE_CONFIG_DT_INST(0),
	MSPI_DMA_CHANNEL(STM32_MSPI_NODE, tx, TX, MEMORY, PERIPHERAL)
	MSPI_DMA_CHANNEL(STM32_MSPI_NODE, rx, RX, PERIPHERAL, MEMORY)
};

static void flash_stm32_mspi_irq_config_func(const struct device *dev)
{
	IRQ_CONNECT(DT_IRQN(STM32_MSPI_NODE), DT_IRQ(STM32_MSPI_NODE, priority),
		    flash_stm32_mspi_isr, DEVICE_DT_INST_GET(0), 0);
	irq_enable(DT_IRQN(STM32_MSPI_NODE));
}

DEVICE_DT_INST_DEFINE(0, &flash_stm32_mspi_init, NULL,
		      &flash_stm32_mspi_dev_data, &flash_stm32_mspi_cfg,
		      POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,
		      &flash_stm32_mspi_driver_api);
